#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/philward_io/philward_io/runs/run-fmLL8ZznXStGAkaM

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...
aws_cloudfront_origin_access_identity.resume_oai: Refreshing state... [id=E1AVBUZT0CBMF6]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Reading...
aws_s3_bucket.resume_bucket: Refreshing state... [id=resume.philward.io]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_iam_policy_document.resume_bucket_policy_document: Reading...
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E5CPX462LFNKX]
aws_s3_object.resume_bucket_contents["assets/img/profile.png"]: Refreshing state... [id=assets/img/profile.png]
data.aws_iam_policy_document.resume_bucket_policy_document: Read complete after 0s [id=3877817331]
aws_s3_object.resume_bucket_contents["js/scripts.js"]: Refreshing state... [id=js/scripts.js]
aws_s3_object.resume_bucket_contents["css/styles.css"]: Refreshing state... [id=css/styles.css]
aws_s3_object.resume_bucket_contents["assets/img/favicon.png"]: Refreshing state... [id=assets/img/favicon.png]
aws_s3_object.resume_bucket_contents["index.html"]: Refreshing state... [id=index.html]
aws_s3_bucket_policy.resume_bucket_policy: Refreshing state... [id=resume.philward.io]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudfront_distribution.s3_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_distribution" {
        id                             = "E5CPX462LFNKX"
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ default_ttl            = 0 -> 3600
          ~ max_ttl                = 0 -> 86400
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_route53_zone.philward_io_zone will be created
  + resource "aws_route53_zone" "philward_io_zone" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "philward.io"
      + name_servers  = (known after apply)
      + tags_all      = (known after apply)
      + zone_id       = (known after apply)
    }

  # aws_route53domains_registered_domain.philward_io_domain will be created
  + resource "aws_route53domains_registered_domain" "philward_io_domain" {
      + abuse_contact_email = (known after apply)
      + abuse_contact_phone = (known after apply)
      + admin_privacy       = true
      + auto_renew          = true
      + creation_date       = (known after apply)
      + domain_name         = "philward.io"
      + expiration_date     = (known after apply)
      + id                  = (known after apply)
      + registrant_privacy  = true
      + registrar_name      = (known after apply)
      + registrar_url       = (known after apply)
      + reseller            = (known after apply)
      + status_list         = (known after apply)
      + tags_all            = (known after apply)
      + tech_privacy        = true
      + transfer_lock       = true
      + updated_date        = (known after apply)
      + whois_server        = (known after apply)

      + admin_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }

      + name_server {
          + glue_ips = (known after apply)
          + name     = (known after apply)
        }

      + registrant_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }

      + tech_contact {
          + address_line_1    = (known after apply)
          + address_line_2    = (known after apply)
          + city              = (known after apply)
          + contact_type      = (known after apply)
          + country_code      = (known after apply)
          + email             = (known after apply)
          + extra_params      = (known after apply)
          + fax               = (known after apply)
          + first_name        = (known after apply)
          + last_name         = (known after apply)
          + organization_name = (known after apply)
          + phone_number      = (known after apply)
          + state             = (known after apply)
          + zip_code          = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @phil-ward, Action: `pull_request`*